NUMPY

In [4]:
## create a 1d array
import numpy as np
arr=np.array([1,2,3,4,5])
print(arr)
print(type(arr))
print(arr.shape)

[1 2 3 4 5]
<class 'numpy.ndarray'>
(5,)

In [5]:
arr=np.array([1,2,3,4,5])
arr.reshape(1,5)

array([[1, 2, 3, 4, 5]])

In [7]:
##2d array
arr1=np.array([[1,2,3,4,5],[6,7,8,9,1]])
print(arr1)
arr1

[[1 2 3 4 5]
 [6 7 8 9 1]]

array([[1, 2, 3, 4, 5],
       [6, 7, 8, 9, 1]])

In [11]:
## creating identity matrix
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [19]:
## atributes of numpy
arr=np.array([[1,2,3],[4,6,5]])
print('array:\n',arr)
print('shape',arr.shape)
print('number of dimensins:',arr.size)
print('Datatype:',arr.dtype)

array:
 [[1 2 3]
 [4 6 5]]
shape (2, 3)
number of dimensins: 6
Datatype: int64

In [21]:
## numpy vectorized operation
arr1=np.array([1,2,3,4,5])
arr2=np.array([2,4,6,7,8])
print('addition:',arr1+arr2)
print('substraction:',arr2-arr1)
print('multiplication:',arr1*arr2)
print('division:',arr1/arr2)

addition: [ 3  6  9 11 13]
substraction: [1 2 3 3 3]
multiplication: [ 2  8 18 28 40]
division: [0.5        0.5        0.5        0.57142857 0.625     ]

In [24]:
## universal functions
arr=np.array([1,2,3,4,5])
print(np.sqrt(arr))
print(np.exp(arr))
print(np.log(arr))
print(np.sin(arr))

[1.         1.41421356 1.73205081 2.         2.23606798]
[  2.71828183   7.3890561   20.08553692  54.59815003 148.4131591 ]
[0.         0.69314718 1.09861229 1.38629436 1.60943791]
[ 0.84147098  0.90929743  0.14112001 -0.7568025  -0.95892427]

In [26]:
## array slicing and indexing
arr=np.array([[1,2,3,4],[4,5,6,7],[2,7,8,9]])
print('array:',arr)

array: [[1 2 3 4]
 [4 5 6 7]
 [2 7 8 9]]

In [27]:
arr[0][0]

np.int64(1)

In [30]:
arr[1:,2:]

array([[6, 7],
       [8, 9]])

In [33]:

## modify array elements
arr[0][0]=100
print(arr)

[[100   2   3   4]
 [  4   5   6   7]
 [  2   7   8   9]]

In [34]:
## statastics
data=np.array([1,2,3,4,5])
mean=np.mean(data)
std_dev=np.std(data)
normalized_data=(data-mean)/std_dev
print(normalized_data)

[-1.41421356 -0.70710678  0.          0.70710678  1.41421356]

In [35]:
##Logical operation
data>5

array([False, False, False, False, False])

PANDAS

In [40]:
import pandas as pd

In [43]:
data=[1,2,3,4,5]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
## create a series from a dictionary
data={'a':1,'b':2,'c':3}
series=pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [47]:
## giving index to element
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [49]:
## data frame
## create a data frame from a dictionry of list
data={
    'name':['rohith','mickey','spidy'],
    'age':[24,45,64],
    'city':['vizag','chicago','bangalore']
}
df=pd.DataFrame(data)
print(data)
print(type(data))
df

{'name': ['rohith', 'mickey', 'spidy'], 'age': [24, 45, 64], 'city': ['vizag', 'chicago', 'bangalore']}
<class 'dict'>

     name  age       city
0  rohith   24      vizag
1  mickey   45    chicago
2   spidy   64  bangalore

In [75]:
## create a dataframe from a list of dictionary
data=[
    {'name':'pardhu','age':20,'city':'vizag'},
      {'name':'rohith','age':20,'city':'vizag'},
      {'name':'vinod','age':20,'city':'vizag'}
      ]
df=pd.DataFrame(data)
print(df)

     name  age   city
0  pardhu   20  vizag
1  rohith   20  vizag
2   vinod   20  vizag

In [ ]:
## accessing dataframe
df['name']

0    pardhu
1    rohith
2     vinod
Name: name, dtype: object

In [77]:
df.loc[0]

name    pardhu
age         20
city     vizag
Name: 0, dtype: object

In [81]:
df['name']
df.at[1,'age']
df.at[2,'name']

'vinod'

In [82]:
df.iat[2,2]

'vizag'

In [83]:
## data manupulationwith dataframe
df['salary']=[10000000,10000000,1000000]
print(df)

     name  age   city    salary
0  pardhu   20  vizag  10000000
1  rohith   20  vizag  10000000
2   vinod   20  vizag   1000000

In [84]:
df.drop('salary',axis=1)

     name  age   city
0  pardhu   20  vizag
1  rohith   20  vizag
2   vinod   20  vizag

In [86]:
## adding 
df['age']=df['age']+1
df

     name  age   city    salary
0  pardhu   22  vizag  10000000
1  rohith   22  vizag  10000000
2   vinod   22  vizag   1000000